{
    "movie-characters": [
        {
            "id": 1,
            "name": "Galadriel",
            "image": "https://static.wikia.nocookie.net/lotr/images/c/cb/Galadriel.jpg",
            "wikiUrl": "https://lotr.fandom.com/wiki/Galadriel",
            "pronunciation": "guh·LA·dree·uhl",
            "aka": "Alatáriel, Artanis, Nerwen",
            "gender": "F",
            "height": "6'4\"",
            "titles": "Princess of the Ñoldor, Lady of Lórien, Lady of the Galadhrim",
            "birth": {
                "year": "YT 1362",
                "location": "Valinor"
            },
            "death": {
                "year": "Departed to Valinor on September 29, TA 3021",
                "age": 8374
            },
            "culture": "Elves",
            "weapons": "Nenya",
            "spouse": "Celeborn",
            "parents": {
                "mother": "Eärwen",
                "father": "Finarfin"
            },
            "actor": {
                "name": "Cate Blanchett",
                "wikipedia": "https://en.wikipedia.org/wiki/Cate_Blanchett"
            },
            "first-app": {
                "theatrical": {
                    "movie": "fellowship",
                    "minute": 1,
                    "second": 0,
                    "image": "",
                    "source": ""
                },
                "extended": {
                    "movie": "",
                    "minute": 0,
                    "second": 0,
                    "image": "",
                    "source": ""
                }
            },
            "description": "Galadriel was the Lady of the woods of Lothlórien, which she ruled with Celeborn, her husband. One of the greatest of the Elves in Middle-earth, she surpassed nearly all others in beauty, knowledge, and power. She bore Nenya, one of the three Elven rings of power. J.R.R. Tolkien thought of her as one of the mightiest and fairest of all Elves remaining in Middle-earth in the Third Age.",
            "actions": {
                "fellowship": {
                    "quotes": [
                        "Even the smallest person can change the course of the future.",
                        "The quest stands upon the edge of a knife.",
                        "Welcome, Frodo of the Shire, one who has seen the Eye!",
                        "May it be a light to you in dark places, when all other lights go out."
                    ],
                    "accomplishments": [
                        "provides safe haven for the fellowship in her domain of Lorien after the fall of Gandalf",
                        "emparts crucial wisdom and elven gifts to each member of the fellowship",
                        "resists the temptation to take The One Ring from Frodo"
                    ]
                },
                "towers": {
                    "quotes": [
                        "The strength of the Ringbearer is failing. In his heart, Frodo begins to understand. The quest will claim his life."
                    ],
                    "accomplishments": [""]
                },
                "return": {
                    "quotes": [
                        "The power of the Three Rings is ended. The time has come... for the dominion of Men."
                    ],
                    "accomplishments": [
                        "sends Frodo a message of encouragement in Shelob's Lair",
                        "accompanies Frodo, Gandalf, and Elrond upon the departure to Valinor from Middle Earth"  
                    ]
                }
            }
        }
    ]
}